import React, { Component } from 'react';
import './App.css';
import Picturepicture from './Picture/Picturepicture';
//import Zhnyva from './Images';

import Picturename from './Picture/Picturename';
import Answers from './Picture/Answers';

class App extends Component {
	state = {
		questionnumber: [
{"sorce":"images/Zhnyva.png","question":"Хто є автором картини?","answer0":"Тетяна Яблонська","answer1":"Михайло Дмитренко","answer2":"Сергій Васильківський","answer3":"Сергій Світославський","answer4":"Петро Левченко","answer5":"Микола Пимоненко","verity":5,"denotation":"\"Жнива\"","explanation":"Микола Пимоненко зображував реальні картини – тільки те, що бачив на власні очі."},
{"sorce":"images/Zvir.png","question":"У її картинах знаходять втілення язичницькі образи фантастичних чудовиськ і птахів","answer0":"Людмила Мєшкова","answer1":"Марія Приймаченко","answer2":"Євгенія Гапчинська","answer3":"Тетяна Яблонська","answer4":"Галина Москвитіна","answer5":"Галина Гедзєвич","verity":1,"denotation":"\"Горботрус\"","explanation":"Марія Приймаченко малювала звірів, але ніколи в житті не була в зоопарку."},
{"sorce":"images/Motyl.png","question":"Всесвітньо відомий митець лемківського походження.","answer0":"Василь Кандинський","answer1":"Пабло Пікассо","answer2":"Сальвалор Далі","answer3":"Енді Уорхолл","answer4":"Андрій Рубльов","answer5":"Михайло Врубель","verity":3,"denotation":"\"Мотиль\"","explanation":"Серед картин Андрія Варголи — зображення грошових купюр, відомих діячів, продуктів та газет."},
{"sorce":"images/Zaporozhtsy.png","question":"За такими картинами вивчають історію України.","answer0":"Василь Кандинський","answer1":"Іван Айвазовський","answer2":"Михайло Шишкін","answer3":"Ілля Рєпін","answer4":"Ілля Глазунов","answer5":"Казімір Малєвіч","verity":3,"denotation":"\"Запорожці пишуть листа турецькому султану.\"","explanation":"Серед людей, які позували Іллі Рєпіну для цієї картини - відомі особистості тих часів."},
{"sorce":"images/Nich.png","question":"Він вважав своїм завданням писати море лише з натури.","answer0":"Іван Айвазовський","answer1":"Руфін Судковський","answer2":"Ілля Рєпін","answer3":"Архип Куїнджи","answer4":"Іван Крамськой","answer5":"Тарас Шевченко","verity":1,"denotation":"\"Місячна ніч\"","explanation":"Руфін Судковський фарбами відтворював близький йому світ південного моря, повітряної стихії і просторів Причорномор'я."},
{"sorce":"images/NichPicture.png","question":"Хто є автор малюнка, на якому зображена місячна ніч?","answer0":"Ілля Рєпін","answer1":"Іван Айвазовський","answer2":"Руфін Судковський","answer3":"Архип Куїнджи","answer4":"Іван Крамськой","answer5":"Тарас Шевченко","verity":5,"denotation":"\"Місячна ніч на Кос-Аралі\"","explanation":"Художня спадщина Тараса Шевченка - понад 1000 творів, близько 300 з яких вважаються втраченими."},
{"sorce":"images/Genii.png","question":"Кого з українських художників називаюь генієм сучасності?","answer0":"Олег Тістол","answer1":"Анатолій Криволап","answer2":"Ілля Чичкан","answer3":"Арсен Савадов","answer4":"Іван Марчук","answer5":"Олександр Ройтбурд","verity":4,"denotation":"\"Ніч в степу\"","explanation":"Іван Марчук є засновником кількох нових стилів в образотворчому мистецтві."},
{"sorce":"images/Divchyna.png","question":"Хто є автором картини, створеній в манері малювання широким пензлем?","answer0":"Олександр Мурашко","answer1":"Микола Пимоненко","answer2":"Сергій Васильківський","answer3":"Опанас Рокачевський","answer4":"Микола Бодаревський","answer5":"Ілля Рєпін","verity":0,"denotation":"\"Дівчина в червоному капелюсі\"","explanation":"Олександр Мурашко точно моделює пластику жіночого обличчя, фігури, оперує тональними переходами, світлотінню."},
{"sorce":"images/Gim.png","question":"На яке місто виходять вікна на картині Тетяни Яблонської?","answer0":"Харків","answer1":"Чернівці","answer2":"Львів","answer3":"Донецьк","answer4":"Курськ","answer5":"Київ","verity":5,"denotation":"\"Ранок\"","explanation":"Зображена донька Тетяни Яблонської Олена в квартирі по вул. Червоноармійська, 46, м. Київ."},
{"sorce":"images/Dervish.png","question":"Хто є автором малюнка?","answer0":"Микола Пимоненко","answer1":"Олександр Мурашко","answer2":"Опанас Рокачевський","answer3":"Олекса Грищенко","answer4":"Давид Бурлюк","answer5":"Сергій Васильківський","verity":3,"denotation":"\"Танок дервіша\"","explanation":"Олекса Грищенко був прихильником кубізму, пост-кубізму, згодом - експресіонізму, в якому висловлюється насамперед кольором."},
{"sorce":"images/Kvadrat.png","question":"Якої картини немає серед творів Казимира Малевича?","answer0":"Червоний квадрат","answer1":"Чорне коло","answer2":"Чорний хрест","answer3":"Біле на білому","answer4":"Чорний квадрат і червоний квадрат","answer5":"Червоне коло","verity":5,"denotation":"\"Чорний квадрат\"","explanation":"Казимир Малевич - художник-авангардист, засновник супрематизма - прояву абстрактного мистецтва новітнього часу. Немає \"Червоне коло\"."},
{"sorce":"images/Kvity.png","question":"Самобутня художниця, в якої за її словами добре виходять квіти, а пейзажі не дуже.","answer0":"Марія Приймаченко","answer1":"Тетяна Яблонська","answer2":"Катерина Білокур","answer3":"Зинаїда Серебрякова","answer4":"Марина Михайлошина","answer5":"Марія Ралко","verity":2,"denotation":"\"Квіти за тином\"","explanation":"Самобутня художниця Катерина Білокур сама робила пензлі для своїх картин, які були настільки тонкими, що нагадували голку."},
{"sorce":"images/Step.png","question":"Який колір з його емоційною палітрою став візитівкою Анатолія Криволапа?","answer0":"синій","answer1":"сірий","answer2":"чорний","answer3":"рожевий","answer4":"червоний","answer5":"фіолетовий","verity":4,"denotation":"\"Степ\"","explanation":"Анатолій Криволап знайшов більше п'ятидесяти варіантів відтінку червоного. Вся емоційна палітра в одному цьому кольорі."},
{"sorce":"images/Proschavai.png","question":"Картина одного із засновників українського постмодернізму Олександра Ройтбурда називається: \"Прощавай, ...\"","answer0":"Мікеланджело","answer1":"Рафаель","answer2":"Караваджо","answer3":"Леонардо","answer4":"Джото","answer5":"Сандро","verity":2,"denotation":"\"Прощавай, ............\"","explanation":"Олександр Ройтбург написав \"Прощавай, Караваджо\" після викрадення з Одеського музею картини Караваджо \"Поцілунок Іуди\"."},
{"sorce":"images/Andrii.png","question":"Хто є автором картини?","answer0":"Рембрандт","answer1":"Антон Лосенко","answer2":"Тіциан","answer3":"Рубенс","answer4":"Аполлон Мокрицький","answer5":"Іван Сошенко","verity":1,"denotation":"\"Андрій Первозванний\"","explanation":"Одухотвореністю і людським теплом пронизані образи портретованих майстра історичного портрета Антона Лосенко."},
{"sorce":"images/Lopukhina.png","question":"Хто є автор портрету жінки з таємничим поглядом?","answer0":"Володимир Боровіковський","answer1":"Ілля Рєпін","answer2":"Сергій Васильківський","answer3":"Михайло Бойчук","answer4":"Іван Сошенко","answer5":"Аполлон Мокрицький","verity":0,"denotation":"\"Портрет Марії Лопухіної\"","explanation":"Володимир Боровіковський зумів наповнити образ своєї моделі життєвою достовірністю, глибиною почуттів і надзвичайною поетичністю."},
{"sorce":"images/Vusta.png","question":"Видатний український художник, який втративши кисті рук, створив більше 3000 робіт.","answer0":"Вудон Баклицький","answer1":"Давид Беккер","answer2":"Мойсей Абрамович","answer3":"Іван Труш","answer4":"Микола Бідняк","answer5":"Давид Бурлюк","verity":4,"denotation":"\"Гайдамаки\"","explanation":"Не маючи передніх кінцівок, Микола Бідняк вражає досконалістю малюнка, кольоровою гамою і різноманітністю жанрів."},
{"sorce":"images/Zapovit.png","question":"Колекцію картин (67 шт) якого художника було повернуто згідно заповіту з США в Україну?","answer0":"Олекса Грищенко","answer1":"Олександр Мурашко","answer2":"Архип Куїнджі","answer3":"Сергій Світославський","answer4":"Андрій Варгола","answer5":"Сергій Васильківський","verity":0,"denotation":"\"Вітрильник\"","explanation":"Чимало робіт Олекси Грищенка зникло просто тому, що нікому було ними заопікуватися."},
{"sorce":"images/Krasunia.png","question":"Художниця, життєве кредо якої: \"Переступай страх. Дій\"","answer0":"Олена Левченко","answer1":"Жанна Кадирова","answer2":"Катерина Косьяненко","answer3":"Адріана Галецька","answer4":"Марина Скугарєва","answer5":"Євгенія Гапчинська","verity":5,"denotation":" ","explanation":"В Євгенії Гапчинської вийшло об'єднати отриману освіту, спосіб заробітку, працездатність і природний талант."},
{"sorce":"images/Petrykivka.png","question":"Видатна майстриня петриківського розпису","answer0":"Ала Алексеєва","answer1":"Тая Галаган","answer2":"Тетяна Галькун","answer3":"Оксана Мась","answer4":"Влада Ралко","answer5":"Ганна Самарська","verity":5,"denotation":" ","explanation":"Ганна Самарська давно придумала універсальну назву для всіх своїх робіт: «Моя Україна»."},
{"sorce":"images/Schyrets.png","question":"Блискавичний художник-реаліст, один з піонерів нового українського малярства.","answer0":"Володимир Орловський","answer1":"Олексій Поляков","answer2":"Іван Марчук","answer3":"Федір Захаров","answer4":"Олександр Гнилицький","answer5":"Осип Курилас","verity":5,"denotation":"\"На Гуцульщині\"","explanation":"Cуттєва кількість робіт Осипа Куриласа, поборника реалістичних традицій українського живопису, була знищена."},
{"sorce":"images/Divchyna2.png","question":"Цей художник до ілюзії точно виписував дрібні деталі одягу на своїх картинах","answer0":"Микола Бодаревський","answer1":"Микола Брянський","answer2":"Микола Рачків","answer3":"Ілля Рєпін","answer4":"Василь Тропінін","answer5":"Костянтин Маковський","verity":0,"denotation":"\"Українська дівчина\"","explanation":"Картина Миколи Бодаревського була продана на аукціоні в Лондоні у 2005 році за 86000 фунтів."},
{"sorce":"images/Hustka.png","question":"Хто є автором картини?","answer0":"Володимир Боровіковський","answer1":"Ілля Рєпін","answer2":"Сергій Васильківський","answer3":"Михайло Бойчук","answer4":"Микола Бодаревський","answer5":"художник невідомий","verity":5,"denotation":"\"Дівчина в хустці\"","explanation":"художник невідомий."},
{"sorce":"images/Ukrainka.png","question":"Хто є автором картини?","answer0":"Опанас Рокачевський","answer1":"Харитон Платонов","answer2":"Костянтин Трутовський","answer3":"Ілля Рєпін","answer4":"Вітольд Монастирський","answer5":"Антоніна Маєвська","verity":3,"denotation":"\"Українка біля тину\"","explanation":"Ілля Рєпін - художник-реаліст, майстер портрету, побутових та історичних сцен."},
{"sorce":"images/Vinok.png","question":"Хто є автор картини?","answer0":"Костянтин Трутовський","answer1":"Микола Пимоненко","answer2":"Михайло Бойчук","answer3":"Володимир Орловський","answer4":"Олександр Мурашко","answer5":"художник невідомий","verity":0,"denotation":"\"Прикрашання вінком\"","explanation":"В своїх творах Костянтин Трутовський виявляв свою тонку спостережливість, дотепність і поетичне почуття."}
]
}

switchNameHandler=()=>{
	//console.log('Внатуре переключается');
	this.setState({})
}



  render() {
    return (
      <div className="App">
       		<div className='picture'>
       			<Picturepicture src25={this.state.questionnumber[0].sorce}/>
       			<Picturename question25={this.state.questionnumber[0].question}/>
       		</div>
    		<div className='questions'>
    			<h4 id='question'></h4>
    			<button onClick={this.switchNameHandler}>Switch question</button>
    			<ul>
    				<Answers answer={this.state.questionnumber[0].answer0} click={this.switchNameHandler}/>
    				<Answers answer={this.state.questionnumber[0].answer1} click={this.switchNameHandler}/>
    				<Answers answer={this.state.questionnumber[0].answer2} click={this.switchNameHandler}/>
    				<Answers answer={this.state.questionnumber[0].answer3} click={this.switchNameHandler}/>
    				<Answers answer={this.state.questionnumber[0].answer4} click={this.switchNameHandler}/>
    				<Answers answer={this.state.questionnumber[0].answer5} click={this.switchNameHandler}/>
    			</ul>
    		</div>
      </div>
    );
  }
}

export default App;
